Catalogs/ЭлементыКлассификаторовФедеральныхМедрегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЭлементыКлассификаторовФедеральныхМедрегистров</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КлассификаторыФедеральныхМедрегистров</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОписаниеЭлемента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ХарактеристикиОбъектовДляФедеральныхМедрегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ХарактеристикиОбъектовДляФедеральныхМедрегистров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКлассификаторовФедеральныхМедрегистров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УченыеСтепени</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыПрофессиональнойПодготовки</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрофессиональныеСтандарты</v8:Type>
						<v8:Type>cfg:EnumRef.СостоянияСотрудника</v8:Type>
						<v8:Type>cfg:EnumRef.ОтношениеКВоинскойОбязанности</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ОтраслиНауки</v8:Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
						<v8:Type>cfg:CatalogRef.Награды</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольнения</v8:Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
						<v8:Type>cfg:EnumRef.КатегорииДолжностейДляСтатистическогоУчета</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыПроцедурАккредитацииСпециалистов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбразованиеФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыОбразованияФизическихЛиц</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыКадровыхСобытий</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятости</v8:Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
						<v8:Type>cfg:CatalogRef.СостояниеВБраке</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Классификатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыФедеральныхМедрегистров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/КлассификаторыФедеральныхМедрегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КлассификаторыФедеральныхМедрегистров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭлементов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Иерархия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураСправочника</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЭлементыКлассификаторовФедеральныхМедрегистров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

// Возвращает реквизиты справочника, которые образуют естественный ключ для элементов справочника.
//
// Возвращаемое значение:
//  Массив из Строка - имена реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Владелец");
	Результат.Добавить("Код");
	
	Возврат Результат;
	
КонецФункции

// Конец ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ИсправитьНекорректныеКодыЭлементов");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляПодчиненногоСправочника(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает структуру категорий гражданства в мед. регистре.
//
Функция НаименованияКатегорийГражданстваМедицинскихРаботников() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭлементыКлассификаторовФедеральныхМедрегистров.Ссылка КАК Ссылка,
	               |	ЭлементыКлассификаторовФедеральныхМедрегистров.НаименованиеПолное КАК Наименование,
	               |	ВЫБОР
	               |		КОГДА ЭлементыКлассификаторовФедеральныхМедрегистров.Код = ""1""
	               |			ТОГДА ""ГражданинРоссии""
	               |		КОГДА ЭлементыКлассификаторовФедеральныхМедрегистров.Код = ""3""
	               |			ТОГДА ""ИностранныйГражданин""
	               |		КОГДА ЭлементыКлассификаторовФедеральныхМедрегистров.Код = ""4""
	               |			ТОГДА ""БезГражданства""
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК Код
	               |ИЗ
	               |	Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров КАК ЭлементыКлассификаторовФедеральныхМедрегистров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторыФедеральныхМедрегистров КАК КлассификаторыФедеральныхМедрегистров
	               |		ПО ЭлементыКлассификаторовФедеральныхМедрегистров.Владелец = КлассификаторыФедеральныхМедрегистров.Ссылка
	               |ГДЕ
	               |	КлассификаторыФедеральныхМедрегистров.Код = &ИдентификаторКлассификатора";
	
	Запрос.УстановитьПараметр("ИдентификаторКлассификатора", "1.2.643.5.1.13.13.99.2.315");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Гражданство = Новый Структура("ГражданинРоссии, ИностранныйГражданин, БезГражданства");
	
	Пока Выборка.Следующий() Цикл 
		
		Если ПустаяСтрока(Выборка.Код ) Тогда
			Продолжить;
		КонецЕсли;
		
		Гражданство.Вставить(Выборка.Код, Выборка.Наименование);
		
	КонецЦикла;
	
	Возврат Гражданство;
	
КонецФункции	

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление = Данные.НаименованиеПолное;
	
	Если Данные.Ссылка.ЭтоГруппа = Ложь
		И ЗначениеЗаполнено(Данные.Владелец)
		И Данные.Владелец.Код = "1.2.643.5.1.13.13.99.2.319" Тогда
		СтрокаКод = Данные.Ссылка.ОписаниеЭлемента.Найти("code","Поле");
		Если СтрокаКод <> Неопределено 
			И ЗначениеЗаполнено(СтрокаКод.Значение) Тогда
			Представление = СтрокаКод.Значение + " " + Представление;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("НаименованиеПолное");
	Поля.Добавить("Владелец");
	Поля.Добавить("Ссылка");
КонецПроцедуры

// Процедура исправляет неверно заполненные коды элементов некоторых классификаторов НСИ.
Процедура ИсправитьНекорректныеКодыЭлементов(ПараметрыОбновления = Неопределено) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("РаботаВМедицинскомУчреждении") Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	ЭлементовДляИсправления = 0;
	ЭлементовДляИсправления = ЭлементовДляИсправления + ИсправитьНекорректныеКодыЭлементовКлассификатораНСИ("1.2.643.5.1.13.13.11.1066", "ID", "PARENT", ПараметрыОбновления);
	ЭлементовДляИсправления = ЭлементовДляИсправления + ИсправитьНекорректныеКодыЭлементовКлассификатораНСИ("1.2.643.5.1.13.13.99.2.170", "id", "parent_id", ПараметрыОбновления);
	ЭлементовДляИсправления = ЭлементовДляИсправления + ИсправитьНекорректныеКодыЭлементовКлассификатораНСИ("1.2.643.5.1.13.13.99.2.196", "ID", "PARENT_ID", ПараметрыОбновления);
	ЭлементовДляИсправления = ЭлементовДляИсправления + ИсправитьНекорректныеКодыЭлементовКлассификатораНСИ("1.2.643.5.1.13.13.99.2.220", "id", "parent_Id", ПараметрыОбновления);
	
	ЭлементовДляИсправления = ЭлементовДляИсправления + ИсправитьДолжностиМедицинскогоПерсоналаНСИ(ПараметрыОбновления);

	Если ЭлементовДляИсправления = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;	
	
КонецПроцедуры

#Область ИсправлениеНекорректныхКодовЭлементовСлужебные 

Функция ИсправитьНекорректныеКодыЭлементовКлассификатораНСИ(КодКлассификатора, ИмяПоляID, ИмяПоляPARENT, ПараметрыОбновления = Неопределено) Экспорт
	
	КлассификаторСсылка = Справочники.КлассификаторыФедеральныхМедрегистров.НайтиПоКоду(КодКлассификатора);
	
	Если Не ЗначениеЗаполнено(КлассификаторСсылка) Тогда 
	    Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлементыКлассификаторов.Ссылка КАК ЭлементСсылка,
		|	ЭлементыКлассификаторов.НаименованиеПолное КАК НаименованиеПолное,
		|	ОписанияЭлементовДляID.Значение КАК Код,
		|	ОписанияЭлементовДляPARENT.Значение КАК КодРодителя,
		|	ХарактеристикиОбъектов.Объект КАК Объект
		|ПОМЕСТИТЬ ВТЭлементыКлассификаторов
		|ИЗ
		|	Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров КАК ЭлементыКлассификаторов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ОписаниеЭлемента КАК ОписанияЭлементовДляID
		|		ПО ЭлементыКлассификаторов.Ссылка = ОписанияЭлементовДляID.Ссылка
		|			И (ОписанияЭлементовДляID.Поле = &ИмяПоляID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ОписаниеЭлемента КАК ОписанияЭлементовДляPARENT
		|		ПО ЭлементыКлассификаторов.Ссылка = ОписанияЭлементовДляPARENT.Ссылка
		|			И (ОписанияЭлементовДляPARENT.Поле = &ИмяПоляPARENT)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиОбъектов
		|		ПО (ХарактеристикиОбъектов.Характеристика = ЭлементыКлассификаторов.Ссылка)
		|			И (ХарактеристикиОбъектов.Классификатор = ЭлементыКлассификаторов.Владелец)
		|ГДЕ
		|	ЭлементыКлассификаторов.Владелец = &КлассификаторСсылка
		|	И ЭлементыКлассификаторов.Код <> ОписанияЭлементовДляID.Значение
		|	И НЕ ЭлементыКлассификаторов.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица.ЭлементСсылка КАК ЭлементСсылка,
		|	Таблица.НаименованиеПолное КАК НаименованиеПолное,
		|	Таблица.Код КАК Код,
		|	Таблица.КодРодителя КАК КодРодителя,
		|	Таблица.Объект КАК Объект,
		|	КОЛИЧЕСТВО(ТаблицаПодчиненных.Код) КАК КоличествоПодчиненных
		|ИЗ
		|	ВТЭлементыКлассификаторов КАК Таблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЭлементыКлассификаторов КАК ТаблицаПодчиненных
		|		ПО Таблица.Код = ТаблицаПодчиненных.КодРодителя
		|
		|СГРУППИРОВАТЬ ПО
		|	Таблица.ЭлементСсылка,
		|	Таблица.НаименованиеПолное,
		|	Таблица.Код,
		|	Таблица.КодРодителя,
		|	Таблица.Объект
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код,
		|	Объект";
	
	Запрос.УстановитьПараметр("КлассификаторСсылка", КлассификаторСсылка);
	Запрос.УстановитьПараметр("ИмяПоляID", ИмяПоляID);
	Запрос.УстановитьПараметр("ИмяПоляPARENT", ИмяПоляPARENT);
	
	ЭлементыКлассификатора = Запрос.Выполнить().Выгрузить();
	КоличествоЭлементов = ЭлементыКлассификатора.Количество();
	Если КоличествоЭлементов=0 Тогда 
	    Возврат 0;
	КонецЕсли;
	
	Если ПараметрыОбновления<>Неопределено Тогда
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров");
		ЭлементБлокировки.УстановитьЗначение("Владелец", КлассификаторСсылка);
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров");
		ЭлементБлокировки.УстановитьЗначение("Классификатор", КлассификаторСсылка);
		НачатьТранзакцию();
		Попытка 
			Блокировка.Заблокировать();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление информационной базы.Ошибка блокировки'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Предупреждение, , КлассификаторСсылка, "Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров, РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров");
			Возврат КоличествоЭлементов;
		КонецПопытки;
	КонецЕсли;
		
	СкорректироватьДубли(КодКлассификатора, ЭлементыКлассификатора, ИмяПоляID, ИмяПоляPARENT);
	КодыГрупп = Новый Соответствие;
	СоздатьГруппы(КлассификаторСсылка, КодыГрупп, ЭлементыКлассификатора, ""); 
	
	Для Каждого Элемент Из ЭлементыКлассификатора Цикл 
		Если Элемент.КоличествоПодчиненных=0 Тогда 
			Родитель = ?(Элемент.КодРодителя<>"", КодыГрупп[Элемент.КодРодителя], Неопределено); 
			СтарыйОбъект = Элемент.ЭлементСсылка.ПолучитьОбъект();
			СтарыйОбъект.ОбменДанными.Загрузка = Истина; 
            СтарыйОбъект.Код = Элемент.Код; 
			СтарыйОбъект.Родитель = Родитель;
			СуществующийЭлемент = Справочники.ЭлементыКлассификаторовФедеральныхМедрегистров.НайтиПоКоду(Элемент.Код, , Родитель, КлассификаторСсылка);
			Если СуществующийЭлемент <> Неопределено Тогда
				СтарыйОбъект.ПометкаУдаления = Истина;
			КонецЕсли;
			СтарыйОбъект.Записать();
		КонецЕсли;
	КонецЦикла; 
	
	Если ПараметрыОбновления<>Неопределено Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;

	Возврат КоличествоЭлементов;
	
КонецФункции

Процедура СкорректироватьДубли(КодКлассификатора, ЭлементыКлассификатора, ИмяПоляID, ИмяПоляPARENT)
	
	Скорректированные220 = Новый Массив;
	Скорректированные1066 = Новый Массив;
	Для Каждого Элемент Из ЭлементыКлассификатора Цикл
		Если КодКлассификатора = "1.2.643.5.1.13.13.99.2.220" Тогда 
			Если Элемент.Код = "88" Тогда
				СкорректироватьЭлемент220(Скорректированные220, Элемент, "87", "61", ИмяПоляID, ИмяПоляPARENT);
			ИначеЕсли Элемент.Код = "96" Тогда 
				СкорректироватьЭлемент220(Скорректированные220, Элемент, "95", "94", ИмяПоляID, ИмяПоляPARENT);
			ИначеЕсли Элемент.Код = "326" Тогда 
				СкорректироватьЭлемент220(Скорректированные220, Элемент, "325", "287", ИмяПоляID, ИмяПоляPARENT);
			ИначеЕсли Элемент.Код = "492" Тогда 
				СкорректироватьЭлемент220(Скорректированные220, Элемент, "400", "399", ИмяПоляID, ИмяПоляPARENT);
			КонецЕсли;	
		ИначеЕсли КодКлассификатора = "1.2.643.5.1.13.13.11.1066" Тогда 
			Если Элемент.Код = "284" Тогда // Бактериология
				СкорректироватьЭлемент1066(Скорректированные1066, Элемент, "54", "0", ИмяПоляID, ИмяПоляPARENT);
			ИначеЕсли Элемент.Код = "213" Тогда // Гигиеническое воспитание
				СкорректироватьЭлемент1066(Скорректированные1066, Элемент, "162", "0", ИмяПоляID, ИмяПоляPARENT);
			ИначеЕсли Элемент.Код = "231" Тогда // Диетология
				СкорректироватьЭлемент1066(Скорректированные1066, Элемент, "84", "0", ИмяПоляID, ИмяПоляPARENT);
			ИначеЕсли Элемент.Код = "206" Тогда // Лечебное дело
				СкорректироватьЭлемент1066(Скорректированные1066, Элемент, "1", "0", ИмяПоляID, ИмяПоляPARENT);
			ИначеЕсли Элемент.Код = "225" Тогда // Рентгенология
				СкорректироватьЭлемент1066(Скорректированные1066, Элемент, "24", "0", ИмяПоляID, ИмяПоляPARENT);
			ИначеЕсли Элемент.Код = "219" Тогда // Сестринское дело 
				СкорректироватьЭлемент1066(Скорректированные1066, Элемент, "5", "0", ИмяПоляID, ИмяПоляPARENT);
			ИначеЕсли Элемент.Код = "208" Тогда // Стоматология 
				СкорректироватьЭлемент1066(Скорректированные1066, Элемент, "3", "0", ИмяПоляID, ИмяПоляPARENT, "07.10.2015");
			ИначеЕсли Элемент.Код = "209" Тогда // Стоматология ортопедическая
				СкорректироватьЭлемент1066(Скорректированные1066, Элемент, "175", "0", ИмяПоляID, ИмяПоляPARENT);
			ИначеЕсли Элемент.Код = "234" Тогда // Судебно-медицинская экспертиза
				СкорректироватьЭлемент1066(Скорректированные1066, Элемент, "26", "0", ИмяПоляID, ИмяПоляPARENT);
			ИначеЕсли Элемент.Код = "218" Тогда // Фармация 
				СкорректироватьЭлемент1066(Скорректированные1066, Элемент, "4", "0", ИмяПоляID, ИмяПоляPARENT, "07.10.2015");
			ИначеЕсли Элемент.Код = "227" Тогда // Физиотерапия 
				СкорректироватьЭлемент1066(Скорректированные1066, Элемент, "34", "0", ИмяПоляID, ИмяПоляPARENT);
			ИначеЕсли Элемент.Код = "226" Тогда // Функциональная диагностика
				СкорректироватьЭлемент1066(Скорректированные1066, Элемент, "35", "0", ИмяПоляID, ИмяПоляPARENT);
			КонецЕсли;	
		ИначеЕсли КодКлассификатора = "1.2.643.5.1.13.13.99.2.196" Тогда 
			Если Элемент.Код = "43" Тогда
				СкорректироватьЭлемент196(Элемент, "42", "", ИмяПоляID, ИмяПоляPARENT);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура СкорректироватьЭлемент220(Скорректированные, Элемент, НовыйКод, НовыйКодРодителя, ИмяПоляID, ИмяПоляPARENT)
	Если Скорректированные.Найти(Элемент.Код)=Неопределено Тогда
		Скорректированные.Добавить(Элемент.Код);
		Элемент.Код = НовыйКод;
		Элемент.КодРодителя = НовыйКодРодителя;
		Элемент.КоличествоПодчиненных = 1;
		СтарыйОбъект = Элемент.ЭлементСсылка.ПолучитьОбъект();
		СтарыйОбъект.ОбменДанными.Загрузка = Истина;
		Для Каждого СтрокаОписания Из СтарыйОбъект.ОписаниеЭлемента Цикл 
			Если СтрокаОписания.Поле = ИмяПоляID Тогда
				СтрокаОписания.Значение = НовыйКод;
			ИначеЕсли СтрокаОписания.Поле = ИмяПоляPARENT Тогда
				СтрокаОписания.Значение = НовыйКодРодителя;
			КонецЕсли;
		КонецЦикла;
		СтарыйОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура СкорректироватьЭлемент1066(Скорректированные, Элемент, НовыйКод, НовыйКодРодителя, ИмяПоляID, ИмяПоляPARENT, ДатаУпразднения = "")
	Если Скорректированные.Найти(Элемент.Код)=Неопределено Тогда
		Скорректированные.Добавить(Элемент.Код);
		Элемент.Код = НовыйКод;
		Элемент.КодРодителя = НовыйКодРодителя;
		СтарыйОбъект = Элемент.ЭлементСсылка.ПолучитьОбъект();
		СтарыйОбъект.ОбменДанными.Загрузка = Истина;
		Для Каждого СтрокаОписания Из СтарыйОбъект.ОписаниеЭлемента Цикл 
			Если СтрокаОписания.Поле = ИмяПоляID Тогда
				СтрокаОписания.Значение = НовыйКод;
			ИначеЕсли СтрокаОписания.Поле = ИмяПоляPARENT Тогда
				СтрокаОписания.Значение = НовыйКодРодителя;
			ИначеЕсли (Не ПустаяСтрока(ДатаУпразднения)) И СтрокаОписания.Поле = "REL" Тогда
				СтрокаОписания.Значение = "0";
			ИначеЕсли (Не ПустаяСтрока(ДатаУпразднения)) И СтрокаОписания.Поле = "DATEOUT" Тогда
				СтрокаОписания.Значение = ДатаУпразднения;
			КонецЕсли;
		КонецЦикла;
		СтарыйОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура СкорректироватьЭлемент196(Элемент, НовыйКод, НовыйКодРодителя, ИмяПоляID, ИмяПоляPARENT)
	Если Элемент.НаименованиеПолное <> "Дополнительные основания прекращения трудового договора с руководителем организации" Тогда 
		СтарыйОбъект = Элемент.ЭлементСсылка.ПолучитьОбъект();
		СтарыйОбъект.ОбменДанными.Загрузка = Истина;
		Элемент.Код = НовыйКод;
		Элемент.КодРодителя = НовыйКодРодителя;
		Элемент.КоличествоПодчиненных = 0;
		Для Каждого СтрокаОписания Из СтарыйОбъект.ОписаниеЭлемента Цикл 
			Если СтрокаОписания.Поле = ИмяПоляID Тогда
				СтрокаОписания.Значение = НовыйКод;
			ИначеЕсли СтрокаОписания.Поле = ИмяПоляPARENT Тогда
				СтрокаОписания.Значение = НовыйКодРодителя;
			ИначеЕсли СтрокаОписания.Поле = "NAME" Тогда
				СтрокаОписания.Значение = Элемент.НаименованиеПолное;
			КонецЕсли;
		КонецЦикла;
		СтарыйОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьГруппы(КлассификаторСсылка, КодыГрупп, ЭлементыКлассификатора, КодРодителя, Родитель = Неопределено)
	Для Каждого Элемент Из ЭлементыКлассификатора Цикл 
		Если Элемент.КодРодителя = КодРодителя И Элемент.КоличествоПодчиненных>0 Тогда 
			Если ЗначениеЗаполнено(Элемент.Объект) Тогда  
				НаборЗаписей = РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	 			НаборЗаписей.Отбор.Объект.Установить(Элемент.Объект);
	 			НаборЗаписей.Отбор.Классификатор.Установить(КлассификаторСсылка);
				НаборЗаписей.Записать();
			КонецЕсли;
			СтарыйОбъект = Элемент.ЭлементСсылка.ПолучитьОбъект();
			СтарыйОбъект.ОбменДанными.Загрузка = Истина; 
			СтарыйОбъект.ПометкаУдаления = Истина;
			СтарыйОбъект.Записать(); 
			СуществующаяГруппа = Справочники.ЭлементыКлассификаторовФедеральныхМедрегистров.НайтиПоКоду(Элемент.Код, , Родитель, КлассификаторСсылка);
			Если СуществующаяГруппа = Неопределено Тогда 
				НовыйОбъект = Справочники.ЭлементыКлассификаторовФедеральныхМедрегистров.СоздатьГруппу();
	        	НовыйОбъект.Код = Элемент.Код; 
				НовыйОбъект.ОписаниеЭлемента.Очистить();
				Для Каждого СтрокаОписания Из СтарыйОбъект.ОписаниеЭлемента Цикл 
					ЗаполнитьЗначенияСвойств(НовыйОбъект.ОписаниеЭлемента.Добавить(), СтрокаОписания);
				КонецЦикла;
	            НовыйОбъект.Владелец = КлассификаторСсылка; 
	            НовыйОбъект.НаименованиеПолное = Элемент.НаименованиеПолное; 
				НовыйОбъект.Родитель = Родитель;
				НовыйОбъект.Записать();
				КодыГрупп.Вставить(Элемент.Код, НовыйОбъект.Ссылка);
				СоздатьГруппы(КлассификаторСсылка, КодыГрупп, ЭлементыКлассификатора, Элемент.Код, НовыйОбъект.Ссылка);
			Иначе 
				КодыГрупп.Вставить(Элемент.Код, СуществующаяГруппа);
				СоздатьГруппы(КлассификаторСсылка, КодыГрупп, ЭлементыКлассификатора, Элемент.Код, СуществующаяГруппа);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры  

Функция ПолучитьДанныеКлассификатораДолжностиМедицинскогоПерсоналаJSON() Экспорт 
	Макет = Справочники.ЭлементыКлассификаторовФедеральныхМедрегистров.ПолучитьМакет("ДолжностиМедицинскогоПерсоналаНСИ");
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Макет.ПолучитьТекст());
	ДанныеJSON = ПрочитатьJSON(ЧтениеJSON, Истина);
	Возврат ДанныеJSON;
КонецФункции

#КонецОбласти

#Область ИсправлениеКлассификатораДолжностейМедицинскогоПерсоналаСлужебные

Функция ИсправитьДолжностиМедицинскогоПерсоналаНСИ(ПараметрыОбновления)
	
	КлассификаторСсылка = Справочники.КлассификаторыФедеральныхМедрегистров.НайтиПоКоду("1.2.643.5.1.13.13.99.2.181"); 
	
	Если Не ЗначениеЗаполнено(КлассификаторСсылка) Тогда 
	    Возврат 0;
	КонецЕсли;   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлементыКлассификаторов.Ссылка КАК ЭлементСсылка,
		|	ЭлементыКлассификаторов.НаименованиеПолное КАК НаименованиеПолное,
		|	ХарактеристикиОбъектов.Объект КАК Объект
		|ИЗ
		|	Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров КАК ЭлементыКлассификаторов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ОписаниеЭлемента КАК ОписанияЭлементовДляID
		|		ПО ЭлементыКлассификаторов.Ссылка = ОписанияЭлементовДляID.Ссылка
		|			И (ОписанияЭлементовДляID.Поле = ""id"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиОбъектов
		|		ПО ЭлементыКлассификаторов.Ссылка = ХарактеристикиОбъектов.Характеристика
		|			И (ХарактеристикиОбъектов.Классификатор = &Классификатор)
		|ГДЕ
		|	ЭлементыКлассификаторов.Владелец = &Классификатор
		|	И НЕ ЭлементыКлассификаторов.ПометкаУдаления
		|	И ЭлементыКлассификаторов.Код <> ОписанияЭлементовДляID.Значение";
	
	Запрос.УстановитьПараметр("Классификатор", КлассификаторСсылка);
	ПрежниеЭлементы = Запрос.Выполнить().Выгрузить(); 
	КоличествоЭлементов = ПрежниеЭлементы.Количество();
	Если КоличествоЭлементов=0 Тогда 
	    Возврат 0;
	КонецЕсли;   
	
	Если ПараметрыОбновления<>Неопределено Тогда
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.КлассификаторыФедеральныхМедрегистров");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", КлассификаторСсылка);
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров");
		ЭлементБлокировки.УстановитьЗначение("Владелец", КлассификаторСсылка);
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров");
		ЭлементБлокировки.УстановитьЗначение("Классификатор", КлассификаторСсылка);
		НачатьТранзакцию();
		Попытка 
			Блокировка.Заблокировать();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление информационной базы.Ошибка блокировки'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Предупреждение, , КлассификаторСсылка, "Справочник.КлассификаторыФедеральныхМедрегистров, Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров, РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров");
			Возврат КоличествоЭлементов;
		КонецПопытки;
	КонецЕсли;
	
	ОписаниеКлассификатораJSON = Справочники.КлассификаторыФедеральныхМедрегистров.ПолучитьОписаниеКлассификатораДолжностиМедицинскогоПерсоналаJSON();
	ДанныеКлассификатораJSON = Справочники.ЭлементыКлассификаторовФедеральныхМедрегистров.ПолучитьДанныеКлассификатораДолжностиМедицинскогоПерсоналаJSON();
	
	ОписаниеСправочника = ПолучитьОписаниеКлассификатораДолжностей(ОписаниеКлассификатораJSON);
	СправочникСсылка = ОбновитьКлассификаторДолжностейФРМР(КлассификаторСсылка, ОписаниеСправочника);
	СодержимоеСправочника = ПолучитьСодержимоеКлассификатораДолжностей(ДанныеКлассификатораJSON);
	СодержимоеСправочника.Индексы.Добавить("НаименованиеПолное");
	ОтборПоНаименованию = Новый Структура("НаименованиеПолное");
	Для Каждого Элемент Из ПрежниеЭлементы Цикл
		ОтборПоНаименованию.НаименованиеПолное = Элемент.НаименованиеПолное;
		СовпаденияПоНаименованию = СодержимоеСправочника.НайтиСтроки(ОтборПоНаименованию);
		КоличествоСовпадений = СовпаденияПоНаименованию.Количество();
		Если КоличествоСовпадений>0 Тогда
			СовпаденияПоНаименованию[КоличествоСовпадений-1].ЭлементСсылка = Элемент.ЭлементСсылка;
			СовпаденияПоНаименованию[КоличествоСовпадений-1].Объект = ?(ЗначениеЗаполнено(Элемент.Объект), Элемент.Объект, Неопределено);
		КонецЕсли;
	КонецЦикла;
	
	ОбработанныеПрежниеЭлементы = Новый Массив;
	КодыГрупп = Новый Соответствие;
	СоздатьГруппыКлассификатораДолжностей(ОбработанныеПрежниеЭлементы, КлассификаторСсылка, КодыГрупп, СодержимоеСправочника, ""); 
	
	Для Каждого Элемент Из СодержимоеСправочника Цикл 
		Если Элемент.КоличествоПодчиненных=0 Тогда 
			Родитель = ?(Элемент.КодРодителя<>"", КодыГрупп[Элемент.КодРодителя], Неопределено); 
			Если ЗначениеЗаполнено(Элемент.ЭлементСсылка) Тогда 
				НовыйОбъект = Элемент.ЭлементСсылка.ПолучитьОбъект();
				ОбработанныеПрежниеЭлементы.Добавить(Элемент.ЭлементСсылка);
			Иначе 
				ЭлементКлассификатора = Справочники.ЭлементыКлассификаторовФедеральныхМедрегистров.НайтиПоКоду(Элемент.Код, , Родитель, КлассификаторСсылка);
				ЭлементКлассификатораИзДругойГруппы = Справочники.ЭлементыКлассификаторовФедеральныхМедрегистров.НайтиПоКоду(Элемент.Код, , , КлассификаторСсылка);
				Если ЗначениеЗаполнено(ЭлементКлассификатора) Тогда 
					НовыйОбъект = ЭлементКлассификатора.ПолучитьОбъект();
				Иначе 
					НовыйОбъект = Справочники.ЭлементыКлассификаторовФедеральныхМедрегистров.СоздатьЭлемент();
				КонецЕсли;
				Если ЗначениеЗаполнено(ЭлементКлассификатораИзДругойГруппы) И ЭлементКлассификатора<>ЭлементКлассификатораИзДругойГруппы Тогда 
					ОбъектКлассификатораИзДругойГруппы = ЭлементКлассификатораИзДругойГруппы.ПолучитьОбъект();
					ОбъектКлассификатораИзДругойГруппы.ОбменДанными.Загрузка = Истина; 
					ОбъектКлассификатораИзДругойГруппы.ПометкаУдаления = Истина;
					ОбъектКлассификатораИзДругойГруппы.Записать();
				КонецЕсли;
			КонецЕсли;
			НовыйОбъект.ОбменДанными.Загрузка = Истина; 
            НовыйОбъект.Владелец = КлассификаторСсылка; 
            НовыйОбъект.Код = Элемент.Код; 
            НовыйОбъект.НаименованиеПолное = Элемент.НаименованиеПолное; 
			НовыйОбъект.Родитель = Родитель;
			НовыйОбъект.ОписаниеЭлемента.Очистить();
			Для Каждого СтрокаОписания Из Элемент.ОписаниеЭлемента Цикл 
				НовоеОписание = НовыйОбъект.ОписаниеЭлемента.Добавить();
				НовоеОписание.Поле = СтрокаОписания.Ключ;
				НовоеОписание.Значение = СтрокаОписания.Значение;
			КонецЦикла;
			НовыйОбъект.Записать();
		КонецЕсли;
	КонецЦикла; 

	// Если вдруг остались необработанные элементы (например, не удалось их сопоставить по наименованию), пометим их на удаление.
	// Это позволит избежать зацикливания процесса обновления.
	Для Каждого Элемент Из ПрежниеЭлементы Цикл
		Если ОбработанныеПрежниеЭлементы.Найти(Элемент.ЭлементСсылка)=Неопределено Тогда 
			СтарыйОбъект = Элемент.ЭлементСсылка.ПолучитьОбъект();
			Если Не СтарыйОбъект.ПометкаУдаления Тогда  
				СтарыйОбъект.ОбменДанными.Загрузка = Истина; 
				СтарыйОбъект.ПометкаУдаления = Истина;
				СтарыйОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ПараметрыОбновления<>Неопределено Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;

	Возврат КоличествоЭлементов;
	
КонецФункции

Процедура СоздатьГруппыКлассификатораДолжностей(ОбработанныеПрежниеЭлементы, КлассификаторСсылка, КодыГрупп, ЭлементыКлассификатора, КодРодителя, Родитель = Неопределено)
	Для Каждого Элемент Из ЭлементыКлассификатора Цикл 
		Если Элемент.КодРодителя = КодРодителя И Элемент.КоличествоПодчиненных>0 Тогда 
			Если ЗначениеЗаполнено(Элемент.Объект) Тогда  
				НаборЗаписей = РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	 			НаборЗаписей.Отбор.Объект.Установить(Элемент.Объект);
	 			НаборЗаписей.Отбор.Классификатор.Установить(КлассификаторСсылка);
				НаборЗаписей.Записать();
			КонецЕсли;
			Если ЗначениеЗаполнено(Элемент.ЭлементСсылка) Тогда 
				СтарыйОбъект = Элемент.ЭлементСсылка.ПолучитьОбъект();
				СтарыйОбъект.ОбменДанными.Загрузка = Истина; 
				СтарыйОбъект.ПометкаУдаления = Истина;
				СтарыйОбъект.Записать();
				ОбработанныеПрежниеЭлементы.Добавить(Элемент.ЭлементСсылка);
			КонецЕсли;
			ЭлементКлассификатора = Справочники.ЭлементыКлассификаторовФедеральныхМедрегистров.НайтиПоКоду(Элемент.Код, , Родитель, КлассификаторСсылка);
			Если ЗначениеЗаполнено(ЭлементКлассификатора) Тогда 
				НовыйОбъект = ЭлементКлассификатора.ПолучитьОбъект();
				НовыйОбъект.ОписаниеЭлемента.Очистить();
			Иначе 
				НовыйОбъект = Справочники.ЭлементыКлассификаторовФедеральныхМедрегистров.СоздатьГруппу();
            	НовыйОбъект.Код = Элемент.Код; 
			КонецЕсли;
			НовыйОбъект.ОбменДанными.Загрузка = Истина; 
            НовыйОбъект.Владелец = КлассификаторСсылка; 
            НовыйОбъект.НаименованиеПолное = Элемент.НаименованиеПолное; 
			НовыйОбъект.Родитель = Родитель;
			Для Каждого СтрокаОписания Из Элемент.ОписаниеЭлемента Цикл
				НовоеОписание = НовыйОбъект.ОписаниеЭлемента.Добавить();
				НовоеОписание.Поле = СтрокаОписания.Ключ;
				НовоеОписание.Значение = СтрокаОписания.Значение;
			КонецЦикла;
			НовыйОбъект.Записать();
			КодыГрупп.Вставить(Элемент.Код, НовыйОбъект.Ссылка);
			СоздатьГруппыКлассификатораДолжностей(ОбработанныеПрежниеЭлементы, КлассификаторСсылка, КодыГрупп, ЭлементыКлассификатора, Элемент.Код, НовыйОбъект.Ссылка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьСодержимоеКлассификатораДолжностей(ДанныеКлассификатораJSON)
	
	СодержимоеКлассификатора = ПустаяТаблицаСодержимогоКлассификатораДолжностейФРМР();
	КоличествоПодчиненных = Новый Соответствие;
	Для Каждого СтрокаЭлемента Из ДанныеКлассификатораJSON["list"] Цикл
		СтруктураЭлемента = Новый Структура();
		Для Каждого ОписаниеРеквизита Из СтрокаЭлемента Цикл
			СтруктураЭлемента.Вставить(ОписаниеРеквизита["column"], ОписаниеРеквизита["value"]);
		КонецЦикла;
		
		Родитель = СтруктураЭлемента["parent_id"];
		ЭлементКлассификатора = СодержимоеКлассификатора.Добавить();
		ЭлементКлассификатора.Код = СтруктураЭлемента["id"];
		ЭлементКлассификатора.НаименованиеПолное = СтруктураЭлемента["work_position"];
		ЭлементКлассификатора.КодРодителя = Родитель;
		ЭлементКлассификатора.ОписаниеЭлемента = СтруктураЭлемента;
		ЭлементКлассификатора.КоличествоПодчиненных = 0;
		
		ПодсчитаноПодчиненных = ?(КоличествоПодчиненных[Родитель]=Неопределено, 0, КоличествоПодчиненных[Родитель]);
		КоличествоПодчиненных.Вставить(Родитель, ПодсчитаноПодчиненных + 1);
	КонецЦикла;  
	
	Для Каждого ЭлементКлассификатора Из СодержимоеКлассификатора Цикл
		ПодсчитаноПодчиненных = ?(КоличествоПодчиненных[ЭлементКлассификатора.Код]=Неопределено, 0, КоличествоПодчиненных[ЭлементКлассификатора.Код]);
		ЭлементКлассификатора.КоличествоПодчиненных = ПодсчитаноПодчиненных;
	КонецЦикла;
	
	Возврат СодержимоеКлассификатора;

КонецФункции

Функция ПолучитьОписаниеКлассификатораДолжностей(ОписаниеКлассификатораJSON)
	
	ОписаниеСправочника = ПустаяСтруктураКлассификатораДолжностейФРМР();
	Для Каждого ЭлементОписания Из ОписаниеСправочника Цикл
		ОписаниеСправочника[ЭлементОписания.Ключ] = ОписаниеКлассификатораJSON[ЭлементОписания.Ключ];
	КонецЦикла;
	ОписаниеСправочника.lastUpdate = СтроковыеФункцииКлиентСервер.СтрокаВДату(ОписаниеКлассификатораJSON["lastUpdate"]);
	ОписаниеСправочника.fieldId = "id";
	
	ПоляСправочника = Новый Структура();
	Для Каждого ПоляСтруктурыСправочника Из ОписаниеКлассификатораJSON["fields"] Цикл
		ПоляСправочника.Вставить(ПоляСтруктурыСправочника["field"], ПоляСтруктурыСправочника["alias"]);
	КонецЦикла;
	
	ОписаниеСправочника.Вставить("fields",ПоляСправочника);
	
	Возврат ОписаниеСправочника;
	
КонецФункции

Функция ПустаяТаблицаСодержимогоКлассификатораДолжностейФРМР()
	ТаблицаСправочникаФРМР = Новый ТаблицаЗначений();
	ТаблицаСправочникаФРМР.Колонки.Добавить("ЭлементСсылка", Новый ОписаниеТипов("СправочникСсылка.ЭлементыКлассификаторовФедеральныхМедрегистров"));
	ТаблицаСправочникаФРМР.Колонки.Добавить("Код",ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаСправочникаФРМР.Колонки.Добавить("НаименованиеПолное",ОбщегоНазначения.ОписаниеТипаСтрока(500));
	ТаблицаСправочникаФРМР.Колонки.Добавить("КодРодителя",ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаСправочникаФРМР.Колонки.Добавить("КоличествоПодчиненных", Новый ОписаниеТипов("Число"));
	ТаблицаСправочникаФРМР.Колонки.Добавить("ОписаниеЭлемента", Новый ОписаниеТипов("Структура"));
	ТаблицаСправочникаФРМР.Колонки.Добавить("Объект");
	Возврат ТаблицаСправочникаФРМР;
КонецФункции

Функция ПустаяСтруктураКлассификатораДолжностейФРМР()
	Результат = Новый Структура();
	Результат.Вставить("oid");
	Результат.Вставить("version");
	Результат.Вставить("rowsCount");
	Результат.Вставить("lastUpdate");
	Результат.Вставить("fullName");
	Результат.Вставить("shortName");
	Результат.Вставить("hierarchical");
	Результат.Вставить("fieldId");
	Результат.Вставить("fields");
	Возврат Результат;
КонецФункции

Функция ОбновитьКлассификаторДолжностейФРМР(Ссылка,ОписаниеСправочника) Экспорт 
	Если ОписаниеСправочника = Неопределено Тогда
		Возврат Справочники.КлассификаторыФедеральныхМедрегистров.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		СправочникОбъект = Ссылка.ПолучитьОбъект();
	Иначе
		НайденноеОписаниеСправочника = Справочники.КлассификаторыФедеральныхМедрегистров.НайтиПоКоду(ОписаниеСправочника.oid);
		Если ЗначениеЗаполнено(НайденноеОписаниеСправочника) Тогда 
			СправочникОбъект = НайденноеОписаниеСправочника.ПолучитьОбъект();
		Иначе
			СправочникОбъект = Справочники.КлассификаторыФедеральныхМедрегистров.СоздатьЭлемент();
		КонецЕсли;
	КонецЕсли;
	
	СправочникОбъект.Наименование = ОписаниеСправочника.shortName;
	СправочникОбъект.Код 		= ОписаниеСправочника.oid;
	СправочникОбъект.Версия		= ОписаниеСправочника.version;
	СправочникОбъект.КоличествоЭлементов = ОписаниеСправочника.rowsCount;
	СправочникОбъект.Иерархия 	= ОписаниеСправочника.hierarchical;
	СправочникОбъект.Изменен 	= ОписаниеСправочника.lastUpdate;
	СправочникОбъект.ПолеИдентификатор = ОписаниеСправочника.fieldId;
	
	СправочникОбъект.СтруктураСправочника.Очистить();
	Для Каждого ПолеСправочника Из ОписаниеСправочника.fields Цикл
		ЭлементСтруктуры = СправочникОбъект.СтруктураСправочника.Добавить();
		ЭлементСтруктуры.ИмяПоля = ПолеСправочника.Ключ;
		ЭлементСтруктуры.Представление = ПолеСправочника.Значение;
	КонецЦикла;
	
	СправочникОбъект.ОбменДанными.Загрузка = Истина;
	
	СправочникОбъект.Записать();
	
	Возврат СправочникОбъект.Ссылка;
		
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
